       
      *> CLASE 18 Ejercicio ejercicio CLASE 18
      *> Ariel Gimenez

       
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CL-18-EJ-18.

       DATA DIVISION.

      *>-----------------------------WORKING-STORAGE----------------------------
       WORKING-STORAGE SECTION.
       01 FILLER PIC X(10) VALUE "LUNES".
           
      *>   -------------------------------------------------------------
      


      *>---------------------------PROCEDURE----------------------------
       PROCEDURE DIVISION.


      *>   PARA QUE SE VEA BIEN AL INICIO
           DISPLAY "          "
           DISPLAY "---------------------------------------------------"
           DISPLAY "          "

      

       *>  TERMINA PROGRAMA
           STOP RUN.
       

